tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-versions.git"
tap "homebrew/command-not-found", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-command-not-found.git"
tap "jesseduffield/lazygit"
tap "oven-sh/bun"
brew "jpeg-xl"
brew "aom"
brew "apr-util"
brew "automake"
brew "bat"
brew "bison"
brew "blueutil"
brew "gdbm"
brew "glib"
brew "libffi"
brew "openssl@1.1"
brew "readline"
brew "python@3.9"
brew "chruby"
brew "libyaml"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "libevent"
brew "folly"
brew "edencommon"
brew "libssh2"
brew "libgit2"
brew "eza"
brew "fastlane"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "freetds"
brew "fzf"
brew "libavif"
brew "gd"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "python@3.11"
brew "gobject-introspection"
brew "harfbuzz"
brew "iperf3"
brew "krb5"
brew "libass"
brew "libksba"
brew "libpq"
brew "neovim"
brew "nexttrace"
brew "openldap"
brew "pango"
brew "pnpm"
brew "protobuf@3"
brew "python@3.10"
brew "rbenv"
brew "ripgrep"
brew "rtmpdump"
brew "smartmontools"
brew "srt"
brew "swiftformat"
brew "telnet"
brew "tesseract"
brew "tldr"
brew "tmux"
brew "watchman"
brew "wget"
brew "zlib"
brew "zoxide"
brew "jesseduffield/lazygit/lazygit"
brew "oven-sh/bun/bun"
cask "1password-cli"
cask "amethyst"
cask "font-hack-nerd-font"
cask "react-native-debugger"
cask "syntax-highlight"
cask "zulu11"
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onelight"
vscode "alefragnani.project-manager"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "ChakrounAnas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "dakara.transformer"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "flowtype.flow-for-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.vscode-pull-request-github"
vscode "Gruntfuggly.todo-tree"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "liviuschera.noctis"
vscode "mhutchie.git-graph"
vscode "michelemelluso.code-beautifier"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "msjsdiag.vscode-react-native"
vscode "naumovs.color-highlight"
vscode "pflannery.vscode-versionlens"
vscode "SimonSiefke.svg-preview"
vscode "sleistner.vscode-fileutils"
vscode "sswg.swift-lang"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vknabel.vscode-swiftformat"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "yoavbls.pretty-ts-errors"
vscode "Zignd.html-css-class-completion"
vscode "zxh404.vscode-proto3"
